[{
  "sort": 1,
  "column": "left",
  "slug": "node-js-custom-web-application-development",
  "title": "Node.js Web Application Development",
  "image": "2.jpg",
  "icon": "nodejs.jpg",
  "excerpt": "Need a wicked-fast, custom web application? Say hello to Javascript!",
  "copy": [
    "Javascript is here to stay.",
    "While it has always been a cross-browser compatible language for creating fancy client-side elements, recently Javascript has been leveraged for server-side logic with Node.js. This means your project can be faster and more unified than ever before.",
    "Most recently, React.js with Redux and Webpack has become the go to environment for new Javascript applications. Let me help you develop an application on the bleeding edge of today's modern web development."
  ],
  "cases" : [
    "<a class='image th right-not-important' href='/projects'><img src='/images/content/projects/screenshots/thumbs/onereview.jpg' alt='One Review' title='One Review'></a> <strong>One Review</strong>: a platform for collecting and analyzing hotel reviews. It is built using Bootstrap, Node.js, Sails.js, MongoDB, and AngularJS to provide a fast, responsive user experience."
  ]
}, {
  "sort": 2,
  "column": "right",
  "slug": "responsive-website-development",
  "title": "Responsive Website Development",
  "image": "9.jpg",
  "excerpt": "Need to bring your website into the modern, mobile age at a fraction of the cost?",
  "copy": [
    "A website is responsive if the same interface is built to optimize the user experience for all devices. This means your website looks great and is easy to use for desktop computer users, tablet users, and mobile phone users. Responsive web design is built by leveraging CSS3 media queries and defining breakpoints so the content changes as the user's device width gets smaller.",
    "What does this mean for you? It means I can develop your website once for all users instead of once for desktop users and another separate website for your mobile visitors. Now that's real savings."
  ]
}, {
  "sort": 3,
  "column": "right",
  "slug": "php-laravel-development",
  "title": "PHP Laravel Development",
  "image": "12.jpg",
  "icon": "laravel.jpg",
  "excerpt": "Laravel is &ldquo;The PHP Framework For Web Artisans.&rdquo; It is the perfect platform for rapidly building secure web applications",
  "copy": [
    "Laravel is &ldquo;The PHP Framework For Web Artisans.&rdquo; It is the perfect platform for rapidly building secure small or large web applications that are maintainable long-term.",
    "Laravel was initially released as an open-source project in June 2011, and has steadily gained popularity ever since. Today, Laravel is unanimously the most popular PHP framework in the world.",
    "I have experience taking over maintenance for existing Laravel applications and starting from scratch by building a solution that is perfectly tailored for your online business."
  ]
}, {
  "sort": 4,
  "column": "left",
  "slug": "custom-wordpress-themes",
  "title": "Custom Wordpress Themes",
  "image": "1.jpg",
  "icon": "wordpress.jpg",
  "excerpt": "Need a custom theme or plugin for your Wordpress site?",
  "copy": [
    "Wordpress is very popular. However, it seems like most of the time, Wordpress projects end up being a collection of poorly hacked together plugins that make the system hard to use as an administrator and hard to navigate as an end-user. I know Wordpress inside and out. I know how to optimize the Wordpress theme and plugins to work together for you, not against you; to get out of your way so you can focus on more important things like blogging and adding valuable content for your visitors to consume."
  ],
  "cases": [
    "<a class='image th right-not-important' href='/projects'><img src='/images/content/projects/screenshots/thumbs/logomaker.jpg' alt='Logo Maker' title='Logo Maker'></a> <strong>Logo Maker</strong>: I was contracted by a technology entrepreneur to build the newest version of his marketing website and blog with a focus on usability and search engine optimization. The result is a fully custom Wordpress theme, built utilizing the power of Zurb Foundation, Yoast SEO plugin, and Advanced Custom Fields.",
    "<a class='image th left-not-important' href='/projects'><img src='/images/content/projects/screenshots/thumbs/roamingfree.jpg' alt='Roaming Free' title='Roaming Free'></a> <strong>Roaming Free</strong>: I was contracted to develop the travel blog for a full-time traveling entrepreneur. The project is a fully custom, responsive Wordpress theme providing the ability to easily share travel stories and track his travels all over the world."
  ]
}, {
  "sort": 5,
  "column": "left",
  "slug": "woocommerce-store-development",
  "title": "WooCommerce Store Development",
  "image": "7.jpg",
  "icon": "woocommerce.jpg",
  "excerpt": "Have something you want to sell online but don't know where to begin?",
  "copy": [
    "Have something you want to sell online but don't know where to begin? Let me introduce you to WooCommerce. WooCommerce is a Wordpress plugin that provides a secure, easy to manage e-commerce solution for your website. I can provide custom WooCommerce integration into any Wordpress theme. You'll be selling your wares online right away."
  ]
}, {
  "sort": 6,
  "column": "right",
  "slug": "custom-web-applications",
  "title": "Custom Web Applications",
  "image": "10.jpg",
  "excerpt": "Need software to accommodate unique, one-of-a-kind business logic? Let me provide the solution.",
  "copy": [
    "What is the difference between a website and a web application? A website is purely informational. It usually provides information about a company's products and services, and is used primarily as a marketing tool. A web application provides a dynamic experience for it's visitors. Web applications usually allow users to register an account and store data and preferences as they interact with the website. Facebook and Twitter are good examples of web applications.",
    "I provide custom, hand-crafted web application development services. Let's bring your idea to life today!"
  ]
}, {
  "sort": 7,
  "column": "right",
  "slug": "content-management-systems",
  "title": "Content Management Systems",
  "image": "4.jpg",
  "excerpt": "Want an easy way to manage all of your website content without calling a developer for every little change?",
  "copy": [
    "The internet is constantly evolving and changing. Your website should too. You should be able to manage every aspect of your website content without having to call a web developer or marketing professional. A content management system (CMS) can provide you the flexibility of managing your content and publishing the results instantly.",
    "I can provide a solution that leverages an established open source content management system like Wordpress or I can build a custom content management system that is perfectly aligned with your business logic and content management needs."
  ],
  "cases": [
    "<a class='image th left-not-important' href='/projects'><img src='/images/content/projects/screenshots/thumbs/mcard-api.jpg' alt='Mobile Card Plus' title='Mobile Card Plus'></a> <strong>Mobile Card Plus</strong>: I developed a fully custom, Node.js based, content management system for the Mobile Card Plus project allowing the administrator to manage all aspects of the marketing website quickly and easily without having to call a developer."
  ]
}, {
  "sort": 8,
  "column": "left",
  "slug": "subscription-membership-systems",
  "title": "Subscription Membership Systems",
  "image": "8.jpg",
  "excerpt": "Have a great idea for an online membership platform? Want monthly recurring passive income?",
  "copy": [
    "Have a great idea for an online membership platform? Want monthly recurring passive income?",
    "I have more than eight years of experience building user-friendly platforms for your custom membership systems. Do you need to offer free trials or coupon codes? Need to offer monthly, bi-monthly, or annual subscriptions on different payment tiers? Anything is possible with a custom platform that perfectly aligns with your business logic."
  ],
  "cases": [
    "<a class='image th right-not-important' href='/projects'><img src='/images/content/projects/screenshots/thumbs/mcard-api.jpg' alt='Mobile Card Plus' title='Mobile Card Plus'></a> <strong>Mobile Card Plus</strong>: I provided consulting and development services for the Mobile Card Plus project. The project consisted of a subscription membership system powered by Stripe, a web interface powered by Node.js and AngularJS, and a mobile app for iOS and Android devices powered by the Ionic Framework.",
    "<a class='image th left-not-important' href='/projects'><img src='/images/content/projects/screenshots/thumbs/logodesign.jpg' alt='Logo Design' title='Logo Design'></a> <strong>Logo Design</strong>: I was contracted to develop a platform for logo designers to showcase their work. The platform features a tiered membership system with recurring monthly billing using the fast and secure Stripe API. I hand-coded the entire back-end using the Yii PHP framework and front-end using Compass/Sass, Browserify, and Mustache templates. The project includes custom integration with Wordpress allowing subscribed members to contribute to the Logo Design blog.",
    "<a class='image th right-not-important' href='/projects'><img src='/images/content/projects/screenshots/thumbs/onereview.jpg' alt='One Review' title='One Review'></a> <strong>One Review</strong>: I was contracted to develop a platform for collecting unbiased hotel reviews. Hotels can subscribe to the system to gain access to a wealth of meaningful analytics about their hotel and other comparable hotels in the same market. I developed the back-end using the Sails real-time Node.js framework and the front-end using Bootstrap, Less, Grunt, AngularJS, and Chart.js."
  ]
}, {
  "sort": 9,
  "column": "left",
  "slug": "pennsylvania-website-consulting",
  "title": "Pennsylvania Website Consulting",
  "image": "5.jpg",
  "excerpt": "",
  "showOnServicesIndex": false,
  "copy": [
    "Need a Pennsylvania website consultant? I have more than eight years experience developing web applications and marketing websites for small businesses and entrepreneurs.",
    "If you are seeking advice on creating a new website or need input on ways to improve your established website, I can help. I'll leverage my experience and my network of top-notch developers and web designers to come up with a solution that is perfect for your small business."
  ]
}, {
  "sort": 10,
  "column": "left",
  "slug": "small-business-marketing-websites",
  "title": "Small Business Marketing Websites",
  "image": "14.jpg",
  "excerpt": "Every business needs a home on the web. I'll get you there.",
  "copy": [
    "Every business needs a website. Your customers need a way of learning more about your products and services and conveniently contacting you. A website that is fast, responsive, and easy to find and navigate could be the edge your business has over the competition. Let me take care of it for you."
  ],
  "cases": [
    "<a class='image th right-not-important' href='/projects'><img src='/images/content/projects/screenshots/thumbs/logomaker.jpg' alt='Logo Maker' title='Logo Maker'></a> <strong>Logo Maker</strong> is a free tool for creating logos online. I developed the marketing website and blog that is used to drive traffic to the logo creation tool. The project is developed as a custom Wordpress theme with particular emphasis on search engine optimization.",
    "<a class='image th left-not-important' href='/projects'><img src='/images/content/projects/screenshots/thumbs/bobbeharris.jpg' alt='Bobbe Harris' title='Bobbe Harris'></a> <strong>Bobbe Harris</strong> is an author who needed to get the word out about her latest book. The marketing website features information about the author and the book as well as a clear call to action on every page driving visitors to purchase her products.",
    "<a class='image th right-not-important' href='/projects'><img src='/images/content/projects/screenshots/thumbs/chainsrequired.jpg' alt='Chains Required' title='Chains Required'></a> <strong>Chains Required</strong> is a small California-based business who needed a fresh site to promote it's services. The wordpress marketing website features large attractive images and information about the business' mission and products."
  ]
}, {
  "sort": 11,
  "column": "left",
  "slug": "search-engine-optimization",
  "title": "Search Engine Optimization (SEO)",
  "image": "6.jpg",
  "excerpt": "Are you looking to improve your online marketing? Do you need more traffic to your website? ",
  "copy": [
    "Are you looking to improve your online marketing? Do you need more traffic to your website? Let's leverage my proven strategy to optimize your website for search engine rankings to drive high quality traffic to your little home on the web.",
    "First, I'll clean up your website. I'll make it as fast as possible by minifying assets, removing unused libraries, and updating the HTML structure to enhance the experience for your users and to make it easier for search engines to parse and index the content.",
    "Then, I'll review your site content to identify important key words, and optimize the content to highlight those keywords.",
    "Finally, I'll iterate on the above steps until you are happy with your search engine rankings and increased web traffic."
  ]
}, {
  "sort": 12,
  "column": "right",
  "slug": "tech-startup-consulting",
  "title": "Tech Startup Consulting",
  "image": "3.jpg",
  "excerpt": "Every startup begins with a great idea. That is the easy part. Turning that great idea into a business is the hard part.",
  "copy": [
    "Every startup begins with a great idea. That is the easy part. Turning that great idea into a business is the hard part. I have more than eight years of experience working with early-stage startups. I can provide the technical know-how to bring your idea to life.",
    "I begin by sitting down with you, the entrepreneur, and really getting an understanding of the problem you are trying to solve. Then, I come up with the software requirements and business logic that will be used to make your product or service provide value in the best, most cost-effective way possible. Next, I help your decide which technology stack to use that will minimize cost, but also be maintainable long-term. Finally, I take care of developing the software according to the requirements we established. In the end, you get a solution that meets the needs of you and your customer and allows you to grow your business and change the world."
  ],
  "cases": [
    "<a class='image th left-not-important' href='/projects'><img src='/images/content/projects/scenes/thumbs/mcard-ionic.jpg' alt='Mobile Card Plus' title='Mobile Card Plus'></a> <strong>Mobile Card Plus</strong>: I provided technical consulting and development services to bring the Mobile Card Plus mobile app and web interface from merely an idea to a full fledged product in the market.",
    "<a class='image th right-not-important' href='/projects'><img src='/images/content/projects/screenshots/thumbs/onereview.jpg' alt='One Review' title='One Review'></a> <strong>One Review</strong>: An entrepreneur with the idea of disrupting the hotel ratings game by providing a platform for facilitating fair and honest hotel reviews hired me to provide technical consulting and development services. The project has been a huge success."
  ]
}, {
  "sort": 13,
  "column": "right",
  "slug": "pennsylvania-web-development-services",
  "title": "Pennsylvania Web Development Services",
  "image": "lake.jpg",
  "excerpt": "",
  "showOnServicesIndex": false,
  "copy": [
    "Looking for a web developer in Pennsylvania? Look no further. I provide web development and consulting services to entrepreneurs and businesses. Let's meet for coffee to discuss your project today!"
  ]
}]
